sdaiIsSubtypeOfBN(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Determines whether an entity definition is a subtype of another entity definition.
\param schemaName [in] A string that contains the schema name.
\param subName    [in] A string that contains the name of the subtype to check.
\param superName  [in] A string that contains the name of the supertype.
\returns sdaiTRUE if the specified entity has a type that is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiED_NDEF - Entity definition not defined.
* sdaiED_NDEQ - Entity definition not domain equivalent.
* sdaiSD_NDEF - Schema definition not defined.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiBoolean isIfcRootSubtypeOfIfcRootBN = sdaiIsSubtypeOfBN("IFC2X3", "ifcroot", "IfcRoot");